/*
 Да се напише програма која за петцифрен број, внесен од стандарден влез, ќе го "искастри".
 Еден број е искастрен ако неговата најлева и најдесна цифра се избришани.
 На излез да се испечатат искастрениот број и во нов ред збирот на цифрите кои се кастрат.
 Појаснување: бројот 54321 искастрен е 432. Цифрите кои се кастрат се 5 и 1.

 Input:
 54321

 Result:
 432
 6
 */

#include <iostream>

using namespace std;

int main() {
    int a, zbir = 0;
    cin >> a;
    zbir += a % 10;
    a /= 10;
    zbir += a / 1000 % 10;
    a %= 1000;
    cout << a << endl << zbir << endl;
    return 0;
}
