/*
 Да се напише програма која ќе го одреди резултатот на студентот по еден предмет.
 Програмата треба да ги изврши следниве задачи:
 1.	Програмата бара внес на следниве податоци од студентот:
    o	Поени на испитот (цел број од 0 до 100).
    o	Присуство на студентот (број на часови посетени во однос на вкупниот број на часови во курсот).
 2.	Проверете дали внесените податоци се валидни. Поените од испитот треба да бидат во опсегот од 0 до 100,
    а присуството на часови треба да биде позитивен  број.
 3.	Вашата задача е да го пресметате резултатот на студентот со следниве критериуми:
    o	Ако бројот на поени на испитот е поголем или еднаков на 60 и присуството е 80% или повеќе од часовите,
        студентот добива  "Odlichna ocenka."
    o	Ако бројот на поени на испитот е поголем или еднаков на 50 и присуството е 70% или повеќе од часовите,
        студентот добива  "Zadovolitelna ocenka."
   o	Во сите други случаи, студентот добива оценка "Prosechen rezultat."
 4.	Прикажете го на екран резултатот на студентот (неговата оценка).

 Input:
 60 0.9

 Result:
 Odlichna ocenka
 */

#include <iostream>

using namespace std;

int main() {
    int poeni;
    float prisustvo;
    cin >> poeni;
    cin >> prisustvo;
    if (poeni < 0 || poeni > 100 || prisustvo < 0) {
        cout << "Nevalidni vlezni podatoci";
    } else {
        if (poeni >= 60 && prisustvo >= 0.8) {
            cout << "Odlichna ocenka";
        } else if (poeni >= 50 && prisustvo >= 0.7) {
            cout << "Zadovolitelna ocenka";
        } else {
            cout << "Prosechen rezultat";
        }
    }
    return 0;
}
