/*
 На ФИНКИ е време за упис на нови студенти.
 За студент да се упиши, треба да пристигне на факултетот пред 9 часот и да чека ред за да биде услужен од студентска служба.
 Студентска служба почнува со работа од 9 часот, работи 2 часа, прави пауза 30 минути,
 работи 1 час, прави пауза 30 минути, работи 2 часа и нејзиното работно време завршува.
 На студентска служба и е потребно точно 5 минути да услужи 1 студент.
 Ваша задача е, ако знаете кој по ред е одреден студент во редицата за чекање,
 да го испечатите времето во часови и минути кое тој го чека за да биде услужен
 или да испечати на стандарден излез доколку студентот не е услужен.

 Input:
 26

 Result:
 Hours: 2, minutes: 35
*/

#include <iostream>

using namespace std;

int main() {
    int red, minuti, vreme, casovi;
    cin >> red;
    red--;
    if (red <= 24) {
        vreme = 5 * red;
    } else if (red <= 36) {
        vreme = 30 + red * 5;
    } else if (red <= 60) {
        vreme = 60 + red * 5;
    } else {
        cout << "Studentot ne e voopsto usluzen" << endl;
        return 0;
    }
    casovi = vreme / 60;
    minuti = vreme % 60;
    cout << "Hours: " << casovi << ", minutes: " << minuti << endl;
    return 0;
}
