/*
 Да се напише програма за калкулатор за цена на билети за кино.
 Цената на билетот зависи од категоријата на филмот и возраста на купувачот.
 Пресметките за цена на билет се следни:
    •	За филмови кои спаѓаат во категорија 1, цената на билетот е 8 долари за сите возрасти.
    •	За филмови кои спаѓаат во категорија 2, цената на билетот е 8 долари за клиенти под 12 години и 12 долари за корисници на 12 години и постари.
    •	За филмови кои спаѓаат во категорија 3, цената на билетот е 10 долари за клиенти помлади од 12 години и 15 долари за клиенти од 12 години и постари.
    •	За филмови кои спаѓаат во категорија 4, цената на билетот е 15 долари за клиенти под 17 години и 18 долари за корисници на 17 години и постари.
 Од стандарден влез се читаат категорија на филмот и возраст на купувачот. Да се испечати цената на билетот.

 Input:
 1 10

 Result:
 Price: 8$
*/

#include <iostream>

using namespace std;

int main() {
    int kategorija, vozrast, cena;
    cin >> kategorija >> vozrast;
    switch (kategorija) {
        case 1:
            cena = 8;
            break;
        case 2: {
            if (vozrast < 12)
                cena = 8;
            else
                cena = 12;
            break;
            case 3: {
                if (vozrast < 12)
                    cena = 10;
                else
                    cena = 15;
                break;
                case 4: {
                    if (vozrast < 17)
                        cena = 15;
                    else
                        cena = 18;
                    break;
                }
            }
        }
    }
    cout << "Price: " << cena << "$" << endl;
    return 0;
}
