/*
 Според регулативата и законот во нашата држава при купување на автомобил од друга држава треба да се плати царина.
 Ања сака да купи автомобил од Бугарија, па затоа решава да подигне кредит.
 Но, при купување на самото возило треба да ги подмири и трошоците за царина.
 Формулата која се користи за пресметка на царината(дмв) во нашата држава е следната:
 дмв = (вмв * пбб) * скд + CO2 + kCO2,
 каде што:
 дмв - данок на моторно возило
 вмв - вредност на моторно возило, купопродажната цена
 пбб - процент за гранични вредности на моторно возило, овој процент се одредува според вредноста на вмв и тоа според следниве правила:
    •	за цена помала од 10000 евра, оваа вредност изнесува 0
    •	за цена почнувајќи од 10000 евра до 20000, оваа вредност изнесува 0.05
    •	за цена почнувајќи од 20000 евра до 30000, оваа вредност изнесува 0.10
    •	за цена почнувајќи од 30000 евра па нагоре, оваа вредност изнесува 0.15
 скд - среден курс на НБРМ, на денарот во однос на еврото, 61,5 денари
 CO2 - емисија на CO2 за соодветно моторно возило
 kCO2 - коефициент кој треба да се пресмета од CO2 според следново правило:
 за возила кои користат бензин:
 - ако вредноста на CO2 е поголема од 0 и помала од 75, оваа вредност изнесува 5
 - за вредности поголеми од 75 па нагоре, оваа вредност изнесува 15
 за возила кои користат дизел:
 - ако вредноста на CO2 е поголема од 0 и помала од 75, оваа вредност изнесува 10
 - за вредности поголеми од 75 па нагоре, оваа вредност изнесува 20
 Откако ќе ја пресметате сумата на данокот, треба да се изврши пресметка на кредитна рата и корисникот да добие информација
 за тоа дали има право да подигне кредит или не. Кредитот треба да ја опфати вкупната сума, односно цената  на автомобилот заедно со сумата за данокот.
 Притоа Ања треба да внесе вредност 1 доколку има веќе некој износ на заштедени средства, во спротивно треба да внесе 0
 (ако внесе 0 и внесе средства треба да и даде порака за грешка).
 Доколку има заштедени средства, оваа вредност треба да се одземе од самата сума која треба да се плати.
 Притоа треба да се провери дали заштедената сума е поголема од вредноста на сумата за кредитот,
 доколку е треба да се отпечати порака дека не треба да зема кредит,
 во спротивно треба да ја пресмета месечната рата на кредитот за дадениот временски период зедно со каматата пресметана со каматна стапка од 0.02.
 Исто така Ања треба да внесе и месечни примања. Доколку вредноста на примањата е помала од вредноста на месечната рата,
 треба да се отпечати порака дека корисникот не може да подигне кредит, во спротивно треба да се испечати месечната рата во денари.
 Треба да се изврши и дополнителна проверка на внесените вредности, односно сите вредности на влез треба да имаат позитивна вредност,
 а гориво и заштеда треба да имаат вредности 0 или 1.
 Упатство: Корисникот треба да ги внесе вредностите по следен редослед: vmv, skd, co2, gorivo (0 - за бензин, 1 - за дизел),
 zashteda(1-доколку има заштеда, 0-доколку нема заштеда), zashteda_sredstva, meseci_na_isplata, mesechen_prihod.
 Сите суми на пaри кое се внесени се во евра, а ратата треба да се добие во денари.
 За пресметка на камата се користи вкупната сума * на колку месеци е земмен кредитот*каматна стапка во проценти,
 а за пресметка на рата се користи  сума од каматата и вкупната сума поделена со број на месеци на кои е земен кредитот.

 Input:
 15000
 61.5
 50
 1
 1
 600
 12
 1500

 Result:
 Vkupno: 932225
 Kreditot ne e odobren
 */

#include <iostream>

using namespace std;

int main() {
    int vmv, kco2, dmv = 0, gorivo, vkupno, zashteda_sredstva, meseci_na_isplata, mesechen_prihod, zashteda;
    float skd, co2, pbb, rata, kamata;
    cin >> vmv >> skd >> co2 >> gorivo >> zashteda >> zashteda_sredstva >> meseci_na_isplata >> mesechen_prihod;
    if (vmv > 0 && skd > 0 && co2 > 0 && (gorivo == 0 || gorivo == 1) &&
        ((zashteda == 0 && zashteda_sredstva == 0) || (zashteda == 1 && zashteda_sredstva > 0)) &&
        zashteda_sredstva >= 0 && meseci_na_isplata > 0 && mesechen_prihod >= 0) {
        if (vmv < 10000)
            pbb = 0;
        else if (vmv >= 10000 && vmv < 20000)
            pbb = 0.05;
        else if (vmv >= 20000 && vmv < 30000)
            pbb = 0.10;
        else
            pbb = 0.15;

        dmv += (vmv * pbb) * skd;
        if (gorivo == 0) {
            if (co2 > 0 && co2 < 75)
                kco2 = 5;
            else
                kco2 = 15;
        } else {
            if (co2 > 0 && co2 < 75)
                kco2 = 10;
            else
                kco2 = 20;
        }
        dmv += kco2 * co2;

        vkupno = dmv + vmv * skd;
        if (zashteda == 1)
            vkupno -= zashteda_sredstva * skd;
        if (vkupno > zashteda_sredstva * skd) {
            cout << "Vkupno: " << vkupno << endl;
            kamata = vkupno * meseci_na_isplata * 0.02;
            rata = vkupno / meseci_na_isplata + kamata / meseci_na_isplata;
            if (mesechen_prihod * skd > rata)
                cout << "Odobren kredit so mesechna rata od: " << rata;
            else
                cout << "Kreditot ne e odobren";
        } else {
            cout << "Nema potreba od kredit";
        }
    } else {
        cout << "Input greshka";
    }
    return 0;
}
