/*
 Во играта Бинго по редослед се извлекуваат непознат број броеви со вредности помеѓу 1 и 90.
 Секогаш се извлекуваат повеќе од 8 броја, додека внесувањето престанува кога ќе се внесе број кој не е во опсегот вредности.
 Освен главната добивка, играчите играат и на џокер број, џокер бројот се формира на следниот начин:
 Се слепуваат помалку значајните цифри од првите 7 извлечени броја,
 и на тој број се додаваат сите следни внесени броеви (не треба да се додаде последниот внесен што е надвор од опсегот).
 Ваша задача е да го отпечатите така добиениот џокер број.

 Објаснување за тест примерот:
 Внесените броеви се
 2 32 45 78 64 21 7 65 18 32 88 1 99
 Помалку значајните цифри од првите седум броеви залепени го даваат бројот  2258417
 на овој број се додава збирот од преостанатите, и се добива 2258621.

 Input:
 2 32 45 78 64 21 7 65 18 32 88 1 99

 Result:
 2258621
*/

#include <iostream>

using namespace std;

int main() {
    int number = 1, counter = 0, joker = 0;
    while (1) {
        cin >> number;
        if (number > 90 || number < 1) break;
        counter++;
        if (counter < 8) joker = joker * 10 + number % 10;
        else joker += number;
    }
    cout << joker;
    return 0;
}
