/*
 Цик-цак е број за кој што важи дека за секој пар соседни цифри, тие се наизменично поголеми односно помали една во однос на друга.
 На пример, ако бројот x е составен од цифрите a, b, c, d и е, тогаш за нив важи:
 a>b, b<c, c>d, d<e или a<b, b>c, c<d, d>e

 Пр. 343, 4624, 6231209
 Од тастатура се читаат непознат број цели броеви поголеми од или еднакви на 10 (броевите помали од 10 се игнорираат).
 Читањето завршува во моментот кога ќе се прочита знак што не е цифра. Да се испечатат сите цик-цак броеви.

 Input:
 343
 22
 4624
 123456
 6231209
 9
 k

 Result:
 343
 4624
 6231209
*/

#include <iostream>

using namespace std;

int main() {
    int a;
    while (cin >> a) {
        if (a < 10)
            continue;
        if ((a >= 10) && (a <= 99)) {
            if ((a % 10) != (a / 10 % 10))
                cout << a << endl;
        }
        int broj = a;
        bool cikcak = false;
        while (a > 99) {
            int c1 = a % 10, c2 = a / 10 % 10, c3 = a / 100 % 10;
            cikcak = false;
            if ((c1 < c2 && c2 > c3) || (c1 > c2 && c2 < c3)) {
                a /= 10;
                cikcak = true;
            } else {
                break;
            }
        }
        if (cikcak)
            cout << broj << endl;
    }
}