/*
 Цик-цак е број за кој важи дека за секој пар соседни цифри во бројот важи дека едната е помала од 5,
 а другата е поголема или еднаква на 5. На пример, ако бројот x е составен од цифрите a, b, c и d, тогаш за нив важи:
 a<5, b>=5, c<5, d>=5 или a>=5, b<5, c>=5, d<5
 Пр.  508294, 2638, 81
 Од тастатура се читаат непознат број на цели броеви поголеми од или еднакви на 10 (броевите помали од 10 се игнорираат).
 Читањето завршува во моментот кога ќе се прочита знак што не е цифра. Да се испечатат сите цик-цак броеви.

 Input:
 5005
 5050
 60619
 21365
 12345
 8045
 8050
 k

 Result:
 5050
 60619
 8050
*/

#include <iostream>

using namespace std;

int main() {
    int a;
    while (cin >> a) {
        bool cikcak = false;
        int broj = a;
        if (a < 10)
            continue;
        else if ((a >= 10) && (a <= 99)) {
            if ((a % 10 >= 5 && 5 > a / 10 % 10) || (a % 10 < 5 && 5 <= a / 10 % 10))
                cout << a << endl;
        } else {
            while (a > 99) {
                cikcak = false;
                if ((a % 10 >= 5 && 5 > a / 10 % 10 && a / 100 % 10 >= 5) ||
                    (a % 10 < 5 && 5 <= a / 10 % 10 && a / 100 % 10 < 5)) {
                    a /= 10;
                    cikcak = true;
                } else {
                    break;
                }
            }
            if (cikcak)
                cout << broj << endl;
        }
    }
}