/*
 За еден природен број а велиме дека е порамнување на друг природен број b
 ако и само ако цифрите еднакви на 9 во бројот b се заменети со цифрата 7 во бројот а.
 Пример: Бројот 734775 е порамнување на бројот 934795.
 Од стандарден влез се внесуваат непознат број на цели броеви (не повеќе од 100),
 се додека не се внесе нешто што не може да се интерпретира како цел број.
 Ваша задача е да ги отпечатите најмалите 5 од порамнувањата на сите внесени броеви, по редослед од најмалиот кон најголемиот.
 Забелешка: Доколку се внесат помалку од 5 броеви, тогаш печатите толку броеви колку што се соодветно внесени.
 Наоѓањето на порамнувањето на даден број треба да се реализира во посебна рекурзивна функција poramnet(int a).
 Пример:
 За броевите: 9592, 69403, 100007, 6, 987, 6977, 33439
 треба да се најдат нивните порамнувања ( тоа се: 7572, 67403, 100007, 6, 787, 6777 и 33437, соодветно),
 и да се отпечатат најмалите 5 од нив по овој редослед: 6 787 6777 7572 33437.
 ЗАБРАНЕТО е користење на глобални променливи.

 Input:
 5
 6
 8
 9
 9
 9
 9
 y

 Result:
 5 6 7 7 7
*/

#include <iostream>

using namespace std;

void swap(int &a, int &b) {
    int temp = a;
    a = b;
    b = temp;
}

void bubbleSort(int a[], int n) {
    bool swapped = true;
    while (swapped) {
        swapped = false;
        for (int i = 0; i < n - 1; i++) {
            if (a[i] > a[i + 1]) {
                swap(a[i], a[i + 1]);
                swapped = true;
            }
        }
    }
}

int poramnet(int n) {
    if (n == 0)
        return 0;
    else {
        int cifra = n % 10;
        if (cifra == 9)
            cifra = 7;
        return poramnet(n / 10) * 10 + cifra;
    }
}

int main() {
    int n = 0, a[100];
    while (cin >> a[n]) {
        n++;
    }
    for (int i = 0; i < n; i++) {
        a[i] = poramnet(a[i]);
    }
    bubbleSort(a, n);
    if (n >= 5)
        for (int i = 0; i < 5; i++)
            cout << a[i] << " ";
    else
        for (int i = 0; i < n; i++)
            cout << a[i] << " ";
    return 0;
}
