/*
 Од стандарден влез се чита природен број N (N <= 100), како и низа a[ ] од N цели броеви.
 Да се напише функција void premesti(а, n) која го преместува секој пронајден негативен број на крајот на низата.
 По преместувањето редоследот на позитивните броеви треба да остане ист како и во оригиналната низа,
 а истото важи и за редоследот на негативните.
 Нaпишете програма која ќе ја повика функцијата premesti за внесената низа a[ ] и потоа ќе ја испечати новодобиената низа.

 Input:
 9 // бројот N на елементи
 1 3 -3 2 5 -7 9 0 3 // елементи на низата

 Result:
 1 3 2 5 0 3 -3 -7 -9 // добиената низа, после преместувањето
*/

#include <iostream>

using namespace std;

void premesti(int a[], int n) {
    int element, m = n;
    for (int i = 0; i < m; i++) {
        if (a[i] < 0) {
            element = a[i];
            for (int j = i + 1; j < n; j++) {
                a[j - 1] = a[j];
            }
            a[n - 1] = element;
            m--;
            i--;
        }
    }
}

int main() {
    int n;
    cin >> n;
    int a[n];
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    premesti(a, n);
    for (int i = 0; i < n; i++) {
        cout << a[i] << " ";
    }
    return 0;
}
