/*
 Еден војник ги извршува командите за марширање на еден офицер.
 Војникот се движи по права патека само од исток кон запад или од запад кон исток.
 Командите кои му ги задава офицерот се: ‘F’ –чекор напред или ‘R’ –налево-круг (промена на ориентацијата на војникот на правата за 180º).
 Војникот на почетокот е на позиција 0 (на бројната оска) ориентиран кон исток (кон позитивната насока на бројната оска).
 Од тастатура се внесуваат командите на офицерот како низа од знаците ‘F’ и ‘R’.
 Напишете програма која ќе ја отпечати финалната позиција на војникот по извршената серија на команди. Серијата команди завршува со ‘.’.

 Input:
 FRFFFRF.

 Result:
 -1
*/

#include <iostream>
#include <cctype>

using namespace std;

int main() {
    int pozicija = 0, movement = 1;
    char a;
    while (cin >> a) {
        if (a == '.')
            break;
        if (tolower(a) == 'f')
            pozicija += movement;
        if (tolower(a) == 'r')
            movement = -movement;
    }
    cout << pozicija << endl;
    return 0;
}
