/*
 Од стандарден влез се читаат соодветно низа со M елементи и низа со N елементи,
 ваша задача е да ги споите двете низи во трета сортирана низа по растечки редослед.
 Објаснување: Се внесува најпрвин должината на првата низа М, па потоа се чита првата низа,
 потоа се внесува должината на втората низа N, па втората низа.
 Напомена: Елементите во двете низи кои се внесуваат се сортирани.
 Максималната должина на низите е 100.

 Input:
 5
 1 4 6 9 15
 4
 2 5 8 10

 Result:
 1 2 4 5 6 8 9 10 15
*/

#include <iostream>

using namespace std;

int main() {
    int n, m, a[100], b[100];
    cin >> n;
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    cin >> m;
    for (int i = 0; i < m; i++) {
        cin >> b[i];
    }
    int c[n + m];

    for (int k = 0, i = 0, j = 0; k < n + m; k++) {
        if ((i < n && (j == m || a[i] < b[j]))) {
            c[k] = a[i];
            i++;
        }
        if ((j < m) && (i == n || b[j] < a[i])) {
            c[k] = b[j];
            j++;
        }
    }

    for (int k = 0; k < n + m; k++) {
        cout << c[k] << " ";
    }
    return 0;
}
