/*
 Од стандарден влез да се прочита квадратна матриција со број на редици и колони N. Прво се вчитува бројот N а потоа и N*N елементите на матрицата.
 Да се промени знакот на елементите од главната дијагонала на матрицата (позитивните да станат негативни и обратно).
 Да се испечати трансформираната матрица на екран (Секој елемент од матрицата се печати со 3 места - %3d).

 Input:
 5
 1   2   3   4   5
 6   7   8   9   10
 11  12  13  14  15
 -1  -2  -3  -4  -5
 -5  -6  -7  -8  -9

 Result:
 -1    2    3    4    5
  6   -7    8    9   10
 11   12   -13   14  15
 -1   -2   -3    4   -5
 -5   -6   -7   -8    9
*/

#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;
    int a[n][n];
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cin >> a[i][j];
        }
    }

    for (int i = 0; i < n; i++) {
        a[i][i] = -a[i][i];
    }

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            printf("%3d", a[i][j]);
        }
        cout << endl;
    }
    return 0;
}
