/*
 Од стандарден влез се вчитува матрица сo n редици и n колони. Прво се вчитува бројот n потоа и елементите на матрицата.
 Матрицата треба да се трансформира така што секој елемент што се наоѓа десно од споредната дијагонала од истата редица
 и е помал од просекот на елементите лево од споредната дијагонала од истата редица треба да се замени со -1.
 Вака трансформираната матрица да се испечати на екран.

 Објаснување на примерот:
 2 3 5 9
 7 8 4 2
 4 2 3 5
 7 10 9 2
 Пример за втората редица, елементот од споредната дијагонала е 4, лево од него се 7 и 8, нивен просек е 7.5 , десно од него е 2, 2 е помал од 7.5 и затоа се заменува со -1.

 Input:
 4
 2 3 5 9
 7 8 4 2
 4 2 3 5
 7 10 9 2

 Result:
 2 3 5 9
 7 8 4 -1
 4 2 -1 5
 7 10 9 2
*/

#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;
    int a[n][n];
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cin >> a[i][j];
        }
    }

    for (int i = 1; i < n - 1; i++) {
        int zbir = 0, brojac = 0, indeks = i;
        for (int j = 0; j < n; j++) {
            while (i + j != n - 1) {
                zbir += a[i][j];
                brojac++;
                j++;
            }
            if (i + j == n - 1) {
                indeks = j + 1;
                break;
            }
        }
        float prosek = (float) zbir / (float) brojac;
        while (indeks < n) {
            if (prosek > (float) a[i][indeks])
                a[i][indeks] = -1;
            indeks++;
        }
    }

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cout << a[i][j] << " ";
        }
        cout << endl;
    }
    return 0;
}
