/*
 Од стандарден влез се вчитува матрица сo m редици и n колони. Прво се вчитуваат броевите m и n а потоа и елементите на матрицата.
 Да се изврши min-max нормализација на секоја колона од матрицата,
 односно секој елемент во секоја колона да се замени со вредноста (x-min)/(max-min),
 каде што x е елемент во некоја колона, а max и min се соодветно најголемиот и најмалиот елемент во соодветната колона.
 Трансформираната матрица да се испечати на екран.

 Објаснување на примерот:
 Елементите на 0-тата колона се: 1, 6, 11, 16, 21. Минимален елемент е 1, а максимален елемент е 21.
 Секој од 5те елементи ќе се трансформира на следниот начин:
	(1-1)/(21-1) = 0/20 = 0.00
	(6-1)/(21-1) = 5/20 = 0.25
	(11-1)/(21-1) = 10/20 = 0.50
	(16-1)/(21-1) = 15/20 = 0.75
	(21-1)/(21-1) = 20/20 = 1.00

 Input:
 5 5
 1 2 3 4 5
 6 7 8 9 10
 11 12 13 14 15
 16 17 18 19 20
 21 22 23 24 25

 Result:
 0.00 0.00 0.00 0.00 0.00
 0.25 0.25 0.25 0.25 0.25
 0.50 0.50 0.50 0.50 0.50
 0.75 0.75 0.75 0.75 0.75
 1.00 1.00 1.00 1.00 1.00
*/

#include <iostream>
#include <iomanip>

using namespace std;

int main() {
    int n, m;
    cin >> m >> n;
    double a[m][n];
    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            cin >> a[i][j];
        }
    }

    for (int i = 0; i < n; i++) {
        double min = a[0][i], max = a[0][i];
        for (int j = 1; j < m; j++) {
            if (a[j][i] > max)
                max = a[j][i];
            if (a[j][i] < min)
                min = a[j][i];
        }
        for (int j = 0; j < m; j++) {
            double formula = (double) (a[j][i] - min) / (double) (max - min);
            a[j][i] = formula;
        }
    }

    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            cout << fixed << setprecision(2) << a[i][j] << " ";
        }
        cout << endl;
    }
    return 0;
}
