/*
 Од стандарден влез се вчитува квадратна матрица со n редици и колони.
 Прво се вчитува бројот n, па потоа и n елементите на матрицата.
 Доколку n е непарен број да се испечати пораката GRESKA и да заврши програмата.
 Потребно е матрицата да се здипли како што е прикажано на сликата.
 При диплење на матрицата, се собираат елементите на позициите што се поклопуваат при диплењето.
 (види слика)

 Input:
 4
 1 2 3 4
 5 6 7 8
 9 10 11 12
 13 14 15 16

 Result:
 34 34
 34 34
*/

#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;
    float a[n][n];
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cin >> a[i][j];
        }
    }
    if (n % 2)
        cout << "GRESKA" << endl;
    else {
        for (int i = 0, k = n - 1; k - i > 0; i++, k--) {
            for (int j = 0; j < n; j++) {
                a[i][j] += a[k][j];
            }
        }
        for (int i = 0; i < n / 2; i++) {
            for (int j = 0, k = n - 1; k - j > 0; j++, k--) {
                a[i][j] += a[i][k];
            }
        }

        n /= 2;
        for (int i = 0; i < n; i++) {
            for (int j = 0; j < n; j++) {
                cout << a[i][j] << " ";
            }
            cout << endl;
        }
    }
    return 0;
}
