/*
 Од стандарден влез да се вчита број N и потоа да се вчитаат N елементи во една низа.
 Внесената низа да се трансформира на начин што парните елементи ќе се зголемат за 1, а непарните ќе се намалат за 1.
 Трансформираната низа да се испечати на стандарден излез, така што елементите ќе се одвоени со празно место меѓу нив.

 Input:
 5
 1 2 3 4 5

 Result:
 0 3 2 5 4
*/

#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;
    int a[n];
    for (int i = 0; i < n; i++) {
        cin >> a[i];
        if (a[i] % 2)
            --a[i];
        else
            ++a[i];
    }
    for (int i = 0; i < n; i++) {
        cout << a[i] << " ";
    }
    return 0;
}
