/*
 Од стандарден влез се чита низа на цели броеви се додека не се внесе нешто различно од цел број.
 Треба да се направи трансформација на низата, на тој начин што за секој елемент,
 сите елементи после него кои што се еднакви со него ќе се зголемат за разликата на позициите помеѓу двата елементи.
 Пример: Низата 5 6 10 5 3 10 10, после трансформација би била 5 6 10 8 3 13 14.

 Input:
 5
 6
 10
 7
 3
 10
 10
 *

 Result:
 5 6 10 7 3 13 14
*/

#include <iostream>

using namespace std;

int main() {
    int a[100], n = 0;
    while (cin >> a[n]) {
        n++;
    }

    for (int i = 0; i < n; i++) {
        for (int j = 1; j < n; j++) {
            if (a[i] == a[j])
                a[j] += (j - i);
        }
    }

    for (int i = 0; i < n; i++) {
        cout << a[i] << " ";
    }
    return 0;
}
