/*
 Од стандарден влез да се вчита број N и потоа да се вчитаат N елементи во една низа.
 Трансформирајте ја низата со удвојување на секој елемент и замена на секој негативен елемент со неговата апсолутна вредност.
 Трансформираната низа да се испечати на стандарден излез, така што елементите ќе се одвоени со празно место меѓу нив.

 Input:
 5
 1 -2 3 -4 5

 Result:
 2 4 6 8 10
*/

#include <iostream>
#include <cmath>

using namespace std;

int main() {
    int n;
    cin >> n;
    int a[n];
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    for (int i = 0; i < n; i++) {
        if (a[i] > 0)
            a[i] *= 2;
        else
            a[i] = fabs(a[i]) * 2;
    }
    for (int i = 0; i < n; i++) {
        cout << a[i] << " ";
    }
    return 0;
}
