/*
 Од стандарден влез се вчитува цел број N. Потоа се внесува низа од N цели броеви.
 Напиши програма која ќе ги трансформира елементите на низата на следниот начин:
 Секој парен елемент, зголеми го за 3, а секој непарен елемент кој е деллив со 5, одземи го за 2.
 На крај, испечати ја трансформираната низа.

 Input:
 7
 5 12 14 15 3 5 9

 Result:
 3 15 17 13 3 3 9
*/

#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;
    int a[n];
    for (int i = 0; i < n; i++) {
        cin >> a[i];
        if (a[i] % 2 == 0)
            a[i] += 3;
        else if (a[i] % 2 == 1 && a[i] % 5 == 0)
            a[i] -= 2;
    }
    for (int i = 0; i < n; i++) {
        cout << a[i] << " ";
    }
    return 0;
}
