/*
 Од стандарден влез се чита цел број n. кој ја претставува должината на една низа,
 а потоа се внесуваат елементите на истата и на крај број k.
 Да се напише програма која ја трансформира низата, така што ќе се направи замена на местата
 помеѓу елементот на позицијата k и неговиот претходник.
 Имајте во предвид дека промената треба да се направи кога низата ја читаме од лево кон десно
 и исто така во спротивен правец (од десно кон лево).

 Input:
 8
 1 2 3 4 5 6 7 8
 2

 Result:
 1 3 2 4 5 7 6 8
*/

#include <iostream>

using namespace std;

int main() {
    int n, k;
    cin >> n;
    int a[n];
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    cin >> k;
    for (int i = 0; i < n; i++) {
        if (i == k || i == n - k) {
            int temp = a[i];
            a[i] = a[i - 1];
            a[i - 1] = temp;
        }
    }
    for (int i = 0; i < n; i++) {
        cout << a[i] << " ";
    }
    return 0;
}
