/*
 На влез имате NxM матрица, каде прво се вчитуваат N и М, а потоа елементите на матрицата.
 Ваша задача е да ги испечатите дијагоналните елементи (види слика) почнувајќи од првиот ред на матрицата.
 Видете тест примери за печатење.
 Напомена: внимавајте во случај да матрицата не е квадратна.

 Input 1:
 3
 3
 1 2 3
 4 5 6
 7 8 9

 Result 1:
 1
 2 4
 3 5 7


 Input 2:
 2
 4
 1 2 3 4
 5 6 7 8

 Result 2:
 1
 2 5
 3 6
 4 7


 Input 3:
 3
 4
 1 2 3 4
 5 6 7 8
 9 1 2 3

 Result 3:
 1
 2 5
 3 6 9
 4 7 1
*/

#include <iostream>

using namespace std;

int main() {
    int n, m;
    cin >> n >> m;
    int a[n][m];
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cin >> a[i][j];
        }
    }
    for (int k = 0; k < m; k++) {
        for (int i = 0; i < n; i++) {
            for (int j = 0; j < m; j++) {
                if (j + i == k)
                    cout << a[i][j] << " ";
            }
        }
        cout << endl;
    }
    return 0;
}
