/*
 Од стандарден влез да се прочита квадратна матрица со број на редици и колони N.
 Прво се вчитува бројот N а потоа и N*N елементите на матрицата.
 Ваша задача е да ги пронајдете минималниот и максималниот број од секоја редица и соодветно да ги промените во 0 и 1 (min = 0, max = 1).
 Доколку најмалиот или најголемиот број се повторуваат повеќе пати треба сите да се променат.
 На крај испечатете ја трансформираната матрица.

 Input:
 4
 55 39 73 46
 21 53 36 88
 96 44 32 64
 39 67 47 25

 Result:
 55 0 1 46
 0 53 36 1
 1 44 0 64
 39 1 47 0
*/

#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;
    int a[n][n];
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cin >> a[i][j];
        }
    }
    for (int i = 0; i < n; i++) {
        int min = a[i][0], max = a[i][0];
        for (int j = 0; j < n; j++) {
            if (a[i][j] > max)
                max = a[i][j];
            if (a[i][j] < min)
                min = a[i][j];
        }
        for (int j = 0; j < n; j++) {
            if (a[i][j] == min)
                a[i][j] = 0;
            if (a[i][j] == max)
                a[i][j] = 1;
        }
    }
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cout << a[i][j] << " ";
        }
        cout << endl;
    }
    return 0;
}
