/*
 Дадени се еден четирицифрен и еден трицифрен број.
 Да се пресмета аритметичка средина на броевите кои се наоѓаат на парните позииции на трицифрениот број
 и на непарните позиции на четирицифрениот број.
 Напомена: Под парни позиции се смета и нултата позиција.
 Пр. за бројот 2468 на нулта позиција е бројот 2, на прва позиција е бр 4, на втора бр 6 и на трета бр 8.

 Input:
 123
 4567

 Result:
 4
 */

#include <iostream>

using namespace std;

int main() {
    int a, b, zbir;
    cin >> a >> b;
    zbir = a % 10 + a / 100 + b % 10 + b / 100 % 10;
    float as = float(zbir) / 4;
    cout << as << endl;
    return 0;
}
