/*
 Да се напише програма каде од стандарден влез се внесува еден 5 цифрен број.
 Програмата печати 1 доколку бројот е специјален, а 0 во спротивно.
 Еден број е специјален доколку за него важи дека е делив со збирот на својата втора и трета цифра,
 и првата, третата и петтата цифра се во строго растечки редослед.
 Да се внимава на делење со 0, т.е. да се испечати -1 во таков случај.

 Input:
 12345

 Result:
 1
 */


#include <iostream>

using namespace std;

int main() {
    int a, zbir = 0;
    bool flag = false;
    cin >> a;
    zbir = a / 100 % 10 + a / 1000 % 10;
    if (a / 10000 < a / 100 % 10 && a / 10000 < a % 10 && a / 100 % 10 < a % 10)
        flag = true;
    if (flag && zbir)
        cout << 1 << endl;
    else if (!zbir)
        cout << -1 << endl;
    else
        cout << 0 << endl;
    return 0;
}
