/*
 Од стандарден влез се внесуваат број x и n, па потоа n цели броеви.
 Да се провери дали бројот x се содржи во внесените n броеви од тастатура.
 Секогаш x ќе биде помал од внесените n броеви после него.
 Броевите што го исполнуваат условот да се испечатат на екран. Доколку нема такви да се испечати Nema.

 Пример: Најпрво се внесуваат x и n (нека x = 23, n = 4).
 Потоа се внесуваат n (во случајов 4) броеви од тастатура (нека бидат 1234, 2333, 1122, 1114455).
 Броевите што треба да се испечатат на екран се:
 1234, 2333, затоа што во нив го содржат бројот х (во случајов 23).

 Input:
 23 4
 1234
 2333
 121134
 341125

 Result:
 1234
 2333
 */

#include <iostream>

using namespace std;

int main() {
    int x, n, a, nuli = 1, brojac = 0;
    cin >> x >> n;
    for (int i = x; i > 0; i /= 10) {
        nuli *= 10;
    }
    for (int i = 0; i < n; i++) {
        cin >> a;
        bool ima = false;
        for (int j = a; j > 0; j /= 10) {
            if (j % nuli == x) {
                ima = true;
                break;
            }
        }
        if (ima) {
            cout << a << endl;
            brojac++;
        }
    }
    if (!brojac)
        cout << "Nema" << endl;
    return 0;
}