/*
 За внесен број N на стандарден влез, да се испечати таблица множење со тој број.
 Напомена: за форматирањето да е униформно на стандарден излез,
 треба да се импортира iomanip библиотеката и да се искористи setw(5) функција
 за отпечатувањата на вредностите за да зафаќаат фиксен број на карактери.

 Input:
 5

 Result:
         1    2    3    4    5
    1    1    2    3    4    5
    2    2    4    6    8   10
    3    3    6    9   12   15
    4    4    8   12   16   20
    5    5   10   15   20   25
*/

#include <iostream>
#include <iomanip>

using namespace std;

int main() {
    int N;
    cin >> N;
    cout << "     ";
    for (int i = 1; i <= N; ++i) {
        cout << setw(5) << i;
    }
    for (int i = 1; i <= N; ++i) {
        cout << endl << setw(5) << i;
        for (int j = 1; j <= N; ++j) {
            cout << setw(5) << i * j;
        }
    }
    return 0;
}
