/*
 Направете калкулатор којшто при внес на оцени по семестар,
 ќе го испечати редниот број на семестарот со најдобар просек.
 На почеток се внесува број N, кој означува колку семестри студентот има запишано.
 За секој од семестрите прво се внесува број M што означува колку внесени оцени има студентот
 и потоа се внесуваат M-те оцени. По внесот на оцените се внесува колку предмети биле предвидени за тој семестар.

 Пример:
 3
 5 9 10 8 9 7 5
 4 8 8 7 9 5
 5 10 8 10 9 9 6
 Од примеров може да заклучиме дека N е 3, односно студентот има запишано 3 семестри,
 за првиот семестар M е 5 - студентот за тој семестар има 5 внесени оцени
 и како последен е внесен бројот 5 што означува колку предмети се предвидени за семестарот.
 На стандарден излез да се испечати редниот број на семестарот кадешто студентот остварил најголем просек,
 просекот за тој семестар и процент на положени предмети/предвидени предмети.
 Просекот се пресметува:
 Просек = (збирОцени / бројОцени) * (бројПредмети/предвидениПредмети) + (1-бројПредмети/предвидениПредмети) * 5

 Input:
 3
 5 9 10 8 9 7 5
 4 8 8 7 9 5
 5 10 8 10 9 9 6

 Result:
 Semester: 1
 Grade point average : 8.6, percentage of subjects passed: 100%
 */

#include <iostream>

using namespace std;

int main() {
    int n, semestar;
    float najgolem = 0;
    float procent;
    cin >> n;
    for (int i = 1; i <= n; i++) {
        int m, ocena;
        float zbir = 0;
        cin >> m;
        for (int j = 0; j < m; j++) {
            cin >> ocena;
            zbir += ocena;
        }
        float predvideni;
        cin >> predvideni;
        float prosek = (zbir / m) * (m / predvideni) + (1 - m / predvideni) * 5;
        if (prosek > najgolem) {
            najgolem = prosek;
            semestar = i;
            procent = (m / predvideni) * 100;
        }
    }
    cout << "Semester: " << semestar << endl;
    cout << "Grade point average : " << najgolem << ", percentage of subjects passed: " << procent << "%" << endl;
    return 0;
}
